cfg_Ideatormer = {
    "expand_factor":1,#2
    "position_bias":False,#是否使用位置编码
    "num_blocks" :[4, 6, 8, 10], #TransformerBlock numbers
    "channels":[16, 32, 64, 128],
    "num_heads" : [2, 4, 8, 16],
    "patchsizes":[32, 16, 8, 4] # TransformerBlock patchsizes
}

"""
1.多尺度重建（多阶段但重建）：指导模型加速收敛
2.空间自注意力：全局上下文信息
3.通道自注意力：通道上下文信息
4.前馈网络使用senet:通道选择增强模块，提高重要特征的权重,加强特征提取
5.加入了先验深度信息，指导图像增强
6.动态和静态的神经网络结合：注意力（动态），卷积（静态）
7.采用DW卷积，减少模型复杂度提模型的效率
8.既考虑了全局上下文信息，也考虑的局部上下文信息。既有空间注意力，也有通道注意力。既有静态神经网络，也有动态神经网络。即解决了vit模型的二次复杂度增长的问题，也解决了swin-transfomer伪全局上下文的信息的融合问题。
"""